studies/KarmanVortexStreet/case/constant/parameters
/*--------------------------------*- C++ -*----------------------------------*/
// global variables for the case
U_inlet    0.00075; //m/s
D          0.2; //m
viscosity  1e-6; //m²/s

Re=U_inlet*D/viscosity; // Reynolds number

