studies/KarmanVortexStreet/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       380992;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       381072;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       381152;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          8712;
        startFace       381552;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          8712;
        startFace       390264;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          384;
        startFace       398976;
    }
)

// ************************************************************************* //
