studies/KarmanVortexStreet/case/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }

#include "parameters"

transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] $viscosity; // Viscosité cinématique de l'eau à 20°C (en m²/s)
