studies/KarmanVortexStreet/case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// choice of base mesh generator
castellatedMesh true;  // mesh cutting (remove cells intersecting geometry)
snap            true;  // mesh snapping to geometry (puts points precisely on the surface)
addLayers       true;  // adding boundary layers (if false, the boundary layer parameters will be ignored)

// geometry and refinement
geometry
{
    cylindre.stl 
    {
        type triSurfaceMesh;
        name cylinder; 
    }
    
    // refinement box definition for the wake region (near the geometry)
    refinementBox
    {
        type box;
        min (-0.5 -0.5 -0.1); // minimum corner of the box 
        max (2.5 0.5 0.1); // maximum corner of the box
    }
};

// mesh generation parameters
castellatedMeshControls
{
    maxLocalCells 400000;
    maxGlobalCells 600000;
    minRefinementCells 10;
    nCellsBetweenLevels 3; // minimum number of cells between different refinement levels
    resolveFeatureAngle 30; // angle in degrees for detecting sharp edges
    allowFreeStandingZoneFaces true; // allow faces not attached to any cell, useful for complex geometries

    features ( { file "cylindre.eMesh"; level 2; } ); // using the edge features from the STL file 

    refinementSurfaces
    {
        cylinder { level (2 2); } // detail level, level n means 2^n = 32 times finer than the base mesh 
    }

    refinementRegions
    {
        refinementBox { mode distance; 
            levels ((0.2 2) (0.4 1)); // Level 3 until 0.5m, then Level 2 until 1.0m
        }
    }

    // initial point for the meshing algorithm, should be inside the domain but outside the geometry
    locationInMesh (-0.6 0 0.025); 
}

// snapping parameters 
snapControls
{
    nSmoothPatch 3; // number of smoothing iterations for the patch before snapping
    tolerance 2.0; // maximum distance a point can move during snapping
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}

// boundary layer parameters
addLayersControls
{
    relativeSizes       true; // layer thickness is relative to the local cell size
    layers
    {
        cylinder
        {
            nSurfaceLayers 3; // number of layers on the geometry surface
        }
    }

    expansionRatio      1.5;   
    finalLayerThickness 0.3;    
    minThickness        0.1;   
    nLayerIter          10; 
    
    // Quality controls for the layers
    nRelaxIter          3;      
    nSmoothSurfaceNormals 1;    
    nSmoothNormals      3;      
    nSmoothThickness    10; 
    nGrow                0; // number of times to grow the layers, 0 means only on the surface    
    maxFaceThicknessRatio 0.5;  
    maxThicknessToMedialRatio 0.3; 
    nMedialAxisIter     10;
    minMedialAxisAngle  90;     
    nBufferCellsNoExtrude 0;  
    
    // angles and pathch control
    featureAngle        60;     
    slipFeatureAngle    30;     
}

// mesh quality parameters
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-9; 
    minArea 1e-13;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist 0.02;
    nSmoothScale 4;
    errorReduction 0.75;
    planarity 1e-4;
}

mergeTolerance 1e-6;